# ch02.
# print(5)
# print(-10)
# print(3.14)
# print(1000)
# print(5+3)
# print(2*8)
# print(3*(3+1))
# 여기까지 "숫자형 자료형"
# ------------------------------------------------
# print('풍선')
# print("나비")
# print("ㅋㅋㅋㅋㅋㅋㅋㅋㅋ")
# print("ㅋ"*9)
# 여기까지 "문자열 자료형"
# ------------------------------------------------
# 참 / 거짓
# print(5 > 10)
# print(5 < 10)
# print(True)
# print(False)
# print(not True)
# print(not (5 > 10))
# 여기까지 "boolean 자료형"
# ------------------------------------------------
# 애완동물을 소개해 주세요~
# animal = "강아지"
# name = "연탄이"
# age = 4
# hobby = "산책"
# is_adult = age >= 3

# print("우리집" + animal + "의 이름은 " + name + "이에요")
# # print(name + "는 " + str(age) + "살이며, " + hobby + "을 아주 좋아해요")
# print(name, "는 ", str(age), "살이며, ", hobby, "을 아주 좋아해요")
# print("연탄이는 어른일까요? " + str(is_adult))

# # print("우리집 강아지의 이름은 연탄이에요")
# # print("연탄이는 4살이며, 산책을 아주 좋아해요")
# # print("연탄이는 어른일까요? True")
# 여기까지 "변수"
# ------------------------------------------------
# 주석은 #으로 시작하거나,
''' 작은 따옴표 3개 입력하면
이렇게
여러문장 주석 가능'''
# 여기까지 "주석"
# ------------------------------------------------